# == pro ==
# 개미 전사는 부족한 식량을 충당하고자 메뚜기 마을의 식량창고를 몰래 공격하려고 합니다. 메뚜기 마을에는 여러 개의 식량창고가 있는데 식량창고는 일직선으로 이어져 있습니다.
# 각 식량창고에는 정해진 수의 식량을 저장하고 있으며 개미 전사는 식량창고를 선택적으로 약탈하여 식량을 빼앗을 예정입니다.
# 이 때, 메뚜기 정찰병들은 일직선 상에 존재하는 식량창고 중에서 서로 인접한 식량창고가 공격받으면 바로 알아챌 수 있습니다.
# 따라서 개미 전사가 정찰병에게 들키지 않고 식량창고를 약탈하기 위해서는 최소한 한 칸 이상 떨어진 식량창고를 약탈해야 합니다.

# 예를 들어 식량창고 4개가 다음과 같이 존재한다고 가정합시다.
# {1, 3, 1, 5}
# 이 때, 개미 전사는 두 번째 식량창고와 네 번째 식량창고를 선택했을 때 최댓값인 총 8개의 식량을 빼앗을 수 있습니다.
# 개미 전사는 식량창고가 이렇게 일직선상일 때 최대한 많은 식량을 얻기를 원합니다.
# 개미 전사를 위해 식량창고 N개에 대한 정보가 주어졌을 때 얻을 수 있는 식량의 최댓값을 구하는 프로그램을 작성하세요.

# 입력 조건
# - 첫째 줄에 식량창고의 개수 N이 주어집니다.
# - 둘째 줄에 공백을 기준으로 각 식량창고에 저장된 식량의 개수 K가 주어집니다.

# 출력 조건
# - 첫째 줄에 개미 전사가 얻을 수 있는 식량의 최댓값을 출력하세요.

# == sol ==
n = int(input()) # 식량창고의 개수
k = list(map(int, input().split())) # 각 식량창고에 저장된 식량의 개수

d = [0] * 100 # dp 테이블 초기화 -> 최적해들의 집합이라고 생각하면 됌

d[0] = k[0] # 0번째 인덱스까지의 최적해 == 식량창고가 1개일 때
d[1] = max(k[0], k[1])

for i in range(2, n): d[i] = max(d[i-1], d[i-2]+k[i])

print(f"{d[n-1]}")