# == pro ==
# 정수 x가 주어졌을 때, 정수 x에 사용할 수 있는 연산은 다음과 같이 4가지입니다.
# 1. x가 5로 나누어 떨어지면 5로 나눕니다.
# 2. x가 3으로 나누어 떨어지면, 3으로 나눕니다.
# 3. x가 2로 나누어 떨어지면, 2로 나눕니다
# 4. x에서 1을 뺍니다.

# 정수 x가 주어졌을 때, 연산 4개를 적절히 사용해서 값을 1로 만들고자 합니다.
# 연산을 사용하는 횟수의 최솟값을 출력하세요. 예를 들어 정수가 26이면 다음과 같이 계산해서 3번의 연산이 최솟값입니다.
# 26 -> 25 -> 5 -> 1

# 입력 조건: 첫째 줄에 정수 x가 주어집니다.

# == sol ==
# dp 테이블을 보텀업 형식으로 채워 넣으면서 들어오는 입력에 맞게 대응하면 될 거 같은데

x = int(input())

d = [0] * 30001 # dp 테이블 생성
# d[i] = i를 1로 만드는데 필요한 최소 횟수

for i in range(2, x+1):
    d[i] = d[i-1] + 1 # -1을 하는 경우 -> 이전(i-1)의 최소 횟수에서 +1(-1한 것)

    if i%2 == 0:
        d[i] = min(d[i], d[i//2]+1) # 2로 나누어 떨어지면 -1을 한 경우(d[i]) vs 2로 나누어 떨어지는 경우(d[i//2]+1) -> 여기의 +1도 나누는 연산을 포함시키기 위해서

    if i%3 == 0:
        d[i] = min(d[i], d[i//3]+1)

    if i%5 == 0:
        d[i] = min(d[i], d[i//5]+1)

print(d[x])