# == pro ==
# N가지 종류의 화폐가 있습니다. 이 화폐들의 개수를 최소한으로 이용해서 그 가치의 합이 M원이 되도록 하려고 합니다.
# 이 때 각 종류의 화폐는 몇 개라도 사용할 수 있습니다.
# 예를 들어 2원, 3원 단위의 화폐가 있을 때는 15원을 만들기 위해 3원을 5개 사용하는 것이 가장 최소한의 화폐 개수입니다.
# M원을 만들기 위한 최소한의 화폐 개수를 출력하는 프로그램을 작성하세요.

# 입력 조건
# - 첫째 줄에 N, M이 주어진다.
# - 이후의 N개의 줄에는 각 화폐의 가치가 주어진다. 화폐의 가치는 10,000보다 작거나 같은 자연수이다.

# 출력 조건: 첫째 줄에 최소 화폐 개수를 출력한다. 불가능할 때는 -1을 출력한다.

# == sol ==
n, m = map(int, input().split()) # N, M 입력
coins = [int(input()) for _ in range(n)] # n개의 각 화폐 가치 입력

# dp 테이블 생성
d = [10001] * (m+1) # d[i] = i원을 만드는 최소 화폐 개수
d[0] = 0

# 로직
for k in coins: # 화폐 가치 리스트 순회
    for i in range(k, m+1): # k~m까지
        if d[i-k] != 10001:
            d[i] = min(d[i], d[i-k]+1)

if d[m] == 10001: print(-1)
else: print(d[m])

# DP 문제의 핵심
# 1. d[i]를 정하기 -> 보통 문제에서 물어보는 것
# 2. dp 테이블 만들고, dp 테이블의 시작값 정하기
# 3. 점화식을 정하기 -> 이전 상태의 답 + 이번 비용
# - 선택지마다 이전 상태의 답 + 이번 비용을 계산해서 min/max 고르기